// TypeScript file
var __reflect = (this && this.__reflect) || function (p, c, t) {
    p.__class__ = c, t ? t.push(c) : t = [c], p.__types__ = p.__types__ ? t.concat(p.__types__) : t;
};
//基本用户数据
var UserInfo = (function () {
    function UserInfo() {
    }
    UserInfo.sex = 1; //性别
    UserInfo.avatar = 'panda_png'; //头像
    UserInfo.nickname = 'nullno'; //名字
    UserInfo.level = 66; //用户等级
    UserInfo.country = 1; //MapsData.LIST 1:中国 ，2：亚洲 ，3：大洋洲 ，4：美洲，5：欧洲
    UserInfo.havePets = ['C1', 'A1', 'C5']; //PetsData.LIST 已获得宠物
    UserInfo.haveProps = ['001/1', '002/2']; // PropsData 已获得道具 卡牌id/数量
    UserInfo.havaMaps = [1]; //已解锁地图
    UserInfo.consumption = 66; //消费金额
    UserInfo.jionDays = 5; //加入天数
    UserInfo.mapPosition = '2557/1254/北京/0/0-'; //当前位置
    UserInfo.defaultMapPosition = '2557/1254/北京/0/0-'; //
    return UserInfo;
}());
__reflect(UserInfo.prototype, "UserInfo");
//任务数据
var TaskData = (function () {
    function TaskData() {
    }
    TaskData.LIST = [];
    return TaskData;
}());
__reflect(TaskData.prototype, "TaskData");
/* PropsData / PetsData
 
   type 可分宠物和道具卡牌类型
   themeColor 卡牌主题色
*/
var PropsData = (function () {
    function PropsData() {
    }
    PropsData.LIST = [
        { tid: '001', type: 1, limt: 5, name: '双倍前进卡', pic: 'card_double', des: '使用此卡后投出骰子将获得骰子点数双倍前进步数。', themeColor: 0x629de8, },
        { tid: '002', type: 1, limt: 5, name: '指定步数卡', pic: 'card_step', des: '使用此卡可以指定前进1-6中任意步数。', themeColor: 0x97be55, },
        { tid: '003', type: 1, limt: 5, name: '成长加倍卡', pic: 'card_heartadd', des: '投掷骰子前进到基础盘面后可使用，当前基础盘面获取成长值加倍。', themeColor: 0xb51512, },
        { tid: '004', type: 1, limt: 5, name: '免扣分卡', pic: 'card_guard', des: '前进到随机事件盘面且遇到扣分事件时可使用，免除当次扣分。', themeColor: 0xef9428, },
    ];
    return PropsData;
}());
__reflect(PropsData.prototype, "PropsData");
//宠物数据
var PetsData = (function () {
    function PetsData() {
    }
    PetsData.LIST = {
        '1': [
            { pid: 'C1', type: '2', pic: 'panda_png', name: '大熊猫', country_id: 1, country_name: '中国', card_pic: 'card_panda_png', themeColor: 0xa3db5a, des: '大熊猫属于食肉目、熊科、大熊猫亚科和大熊猫属唯一的哺乳动物，体色为黑白两色，它有着圆圆的脸颊，大大的黑眼圈，胖嘟嘟的身体，标志性的内八字的行走方式，是世界上最可爱的动物之一。' },
            { pid: 'C2', type: '2', pic: 'Golden_monkey_png', name: '金思猴', country_id: 1, country_name: '中国', card_pic: 'card_Golden_monkey_png', themeColor: 0x9de2bb, des: '金丝猴毛质柔软，鼻子上翘，群栖高山密林中，以浆果、竹笋、苔藓为食，亦喜食鸟蛋等肉类，栖息地海拔很高，身上的长毛可耐寒。' },
            { pid: 'C3', type: '2', pic: 'fox_png', name: '狐狸', country_id: 1, country_name: '中国', card_pic: 'card_fox_png', themeColor: 0xf8a365, des: '狐狸身体纤瘦，毛长且厚，狐狸毛茸茸的尾巴是头部和身体的一半或2/3，尖嘴。大多种狐狸耳朵大、直立、呈三角形。狐狸的眼睛能够适应黑暗，瞳孔椭圆，发亮，类似于猫的眼睛。狐狸具有敏锐的视觉、嗅觉和听觉。大部分狐狸具有刺鼻的味道，由尾巴根部的臭腺放出。' },
            { pid: 'C4', type: '2', pic: 'Asian_elephant_png', name: '亚洲象', country_id: 1, country_name: '中国', card_pic: 'card_Asian_elephant_png', themeColor: 0x96d4b7, des: '亚洲象是亚洲现存的最大陆生动物，长达1米多的象牙，是雄象上颌突出口外的门齿，也是强有力的防卫武器。象的眼小耳大，耳朵向后可遮盖颈部两侧。四肢粗大强壮，前肢5趾，后肢4趾。尾短而细，皮厚多褶皱，全身被稀疏短毛。' },
            { pid: 'C5', type: '2', pic: 'white_dolphins_png', name: '白鳍豚', country_id: 1, country_name: '中国', card_pic: 'card_White_dolphins_png', themeColor: 0x5097da, des: '白鳍豚是中国特有的一种小型淡水鲸，仅产于长江中下游水系，有“长江女神” “水中大熊猫” “水中国宝”之称。白鳍豚身体呈纺锤形。全身皮肤裸露无毛，光滑而富有弹性，能够减少在水中快速游动时产生的阻力。', },
        ],
        '2': [
            { pid: 'A1', type: '2', pic: 'Koala_png', name: '树袋熊', country_id: 2, country_name: '亚洲', card_pic: 'card_Koala_png', themeColor: 0xd0bc72, des: '树袋熊，又称考拉，是澳大利亚的国宝，也是澳大利亚奇特的珍贵原始树栖动物。树袋熊从他们取食的桉树叶中获得所需的90%的水分，只在生病和干旱的时候喝水，当地人称它“克瓦勒”，意思也是“不喝水”。它每天18个小时处于睡眠状态，性情温顺，体态憨厚。', },
            { pid: 'A2', type: '2', pic: 'sloth_png', name: '树懒', country_id: 2, country_name: '亚洲', card_pic: 'card_sloth_png', themeColor: 0xe6b779, des: '树懒形状略似猴，动作迟缓，常用爪倒挂在树枝上数小时不移动，故称之为树懒。树懒虽然有脚但是却不能走路，靠得是前肢拖动身体前行。终年栖居树上，用爪钩住树枝倒挂身躯，并在树上移行。嗅觉灵敏，视觉和听觉不很发达，以树叶、果实为食。', },
            { pid: 'A3', type: '2', pic: 'lion_png', name: '狮子', country_id: 2, country_name: '亚洲', card_pic: 'card_lion_png', themeColor: 0xF6AF57, des: '狮子体型大，躯体均匀，四肢中长，头大而圆，视、听、嗅觉均很发达，皮毛柔软，有“草原之王”的称号，是非洲顶级的猫科食肉动物。雄狮有很长的鬃毛，长长的鬃毛一直延伸到肩部和胸部。生活在热带稀树草原和草地，也出现于灌木和旱林。', },
        ]
    };
    return PetsData;
}());
__reflect(PetsData.prototype, "PetsData");
//地图数据 北京->北京 position[x/y/城市（无填-表示）/索引/奖励事件（无填-表示）]
var MapsData = (function () {
    function MapsData() {
    }
    MapsData.pieceNum = 25; //地图切片数量
    MapsData.scale = 1; //地图缩放
    MapsData.award = {
        'a1': { name: '道具屋' },
        'a2': { name: '宠物屋' },
        'a3': { name: '权益屋' },
        'a4': { name: '停下来随机前进1-6步' },
        'a5': { name: '两个色子：双倍前进' },
        'a6': { name: '？：随机奖励' },
        'a7': { name: '💗：体力加1' },
        'a8': { name: '2倍：双倍成长值' }
    };
    MapsData.LIST = {
        '1': {
            width: 5010, height: 3460, one_width: 1002, one_height: 692, name: '中国',
            position: '2557/1254/北京/0/-, 2469/1299/0/1/a8, 2370/1346/0/2/-, 2468/1396/河北/3/-, 2567/1437/-/4/a6, 2660/1394/-/5/-, 2755/1344/天津/6/-, 2848/1393/-/7/a4, 2948/1439/-/8/a5, 2848/1483/-/9/-, 2948/1535/山东/10/-, 3045/1577/-/11/-, 2947/1633/-/12/-, 3055/1675/-/13/a3, 2951/1730/河南/14/-, 3047/1772/-/15/-, 3143/1818/-/16/-, 3236/1868/湖北/17/-, 3338/1914/-/18/a2, 3244/1964/-/19/-, 3336/2010/-/20/a5, 3432/2060/湖南/21/-, 3530/2010/-/22/-, 3624/1958/-/23/-, 3714/1912/-/24/a7, 3624/1870/江西/25/-, 3522/1820/-/26/-, 3618/1774/-/27/-, 3520/1730/-/28/a6, 3426/1678/-/29/-, 3330/1636/安徽/30/-, 3422/1588/-/31/a4, 3332/1542/-/32/a7, 3428/1490/江苏/33/-, 3522/1440/-/34/-, 3616/1492/-/35/a8, 3710/1542/上海/36/-, 3808/1588/-/37/-, 3900/1640/-/38/-, 4000/1680/浙江/39/-, 3910/1714/-/40/a1, 3992/1774/-/41/-, 4098/1822/福建/42/-, 4186/1766/-/43/a6, 4276/1726/-/44/-, 4370/1676/-/45/a7, 4462/1726/-/46/-, 4560/1768/-/47/-, 4470/1822/台湾/48/-, 4376/1872/-/49/a8, 4276/1910/-/50/-, 4190/1958/香港/51/-, 4084/2008/-/52/-, 3996/2050/-/53/a3, 3890/2110/澳门/54/-, 3802/2150/-/55/-, 3700/2198/-/56/a6, 3612/2245/广东/57/-, 3706/2290/-/58/-, 3804/2328/-/59/a2, 3901/2384/-/60/-, 3994/2430/-/61/-, 4095/2478/-/62/-, 3997/2522/海南/63/-, 3895/2572/-/64/-, 3805/2526/-/65/a7, 3715/2482/-/66/a4, 3629/2422/-/67/a1, 3519/2480/-/68/a8, 3425/2528/广西/69/-, 3335/2568/-/70/-, 3237/2614/-/71/a3, 3147/2670/-/72/-, 3057/2716/-/73/a6, 2961/2664/-/74/-, 2865/2618/云南/75/-, 2773/2568/-/76/-, 2872/2525/-/77/a6, 2967/2476/-/78/-, 2871/2432/-/79/a8, 2967/2378/-/80/-, 3057/2340/-/81/-, 3145/2292/-/82/-, 3237/2244/贵州/83/-, 3149/2198/-/84/-, 3059/2152/-/85/-, 2961/2106/-/86/a8, 2863/2150/重庆/87/-, 2769/2200/-/88/-, 2685/2224/-/89/a5, 2583/2200/-/90/-, 2487/2150/-/91/-, 2395/2200/-/92/a1, 2307/2246/-/93/-, 2205/2294/四川/94/-, 2117/2342/-/95/-, 2021/2280/-/96/a4, 1925/2342/-/97/-, 1837/2384/-/98/-, 1931/2430/-/99/-, 1841/2482/-/100/-,1739/2526/-/101/-,1643/2578/-/102/-,1555/2620/-/103/a8,1459/2570/-/104/-,1361/2620/-/105/-,1267/2668/西藏/106/-,1167/2620/-/107/a7,1075/2572/-/108/-,975/2618/-/109/a6,881/2570/-/110/a2,785/2523/-/111/-,691/2477/-/112/-,593/2433/-/113/a5,501/2387/新疆/114/-,593/2335/-/115/-,685/2289/-/116/a4,595/2243/-/117/-,681/2191/-/118/a6,777/2143/-/119/-,871/2093/-/120/a8,959/2049/-/121/-,1053/2097/-/122/a6,1160/2143/-/123/-,1269/2185/-/124/-,1347/2235/青海/125/-,1439/2187/-/126/a3,1530/2140/-/127/-,1427/2087/-/128/-,1340/2047/-/129/a7,1435/2001/-/130/-,1533/1953/-/131/a6,1622/1907/甘肃/132/-,1525/1855/-/133/-,1620/1813/-/134/-,1721/1773/-/135/a5,1813/1719/-/136/-,1715/1671/-/137/-,1809/1627/-/138/a8,1909/1575/-/139/-,1997/1619/-/140/-,2101/1669/-/141/a6,2191/1715/-/142/-,2091/1765/宁夏/143/-,2191/1811/-/144/-,2285/1861/-/145/a4,2391/1811/-/146/-,2483/1765/陕西/147/-,2567/1719/-/148/-,2671/1663/-/149/a1,2559/1621/-/150/-,2473/1573/-/151/-,2377/1531/山西/152/-,2279/1483/-/153/a5,2173/1435/-/154/-,2091/1385/-/155/-,1985/1345/内蒙古/156/-,1889/1285/-/157/a3,1989/1249/-/158/-,2081/1203/-/159/-,2173/1157/-/160/-,2081/1103/-/161/a6,2175/1055/-/162/-,2083/1011/-/163/-,2177/969/-/164/a7,2081/917/-/165/a8,1987/872/-/166/-,1893/827/-/167/-,1981/779/-/168/-,2081/731/-/169/a5,2175/683/-/170/-,2275/641/黑龙江/171/-,2367/677/-/172/-,2461/729/-/173/a2,2553/785/-/174/-,2463/827/吉林/175/-,2559/873/-/176/-,2655/923/-/177/a6,2747/975/辽宁/178/-,2643/1019/-/179/-,2557/1061/-/180/-,2659/1115/-/181/a7,2559/1153/-/182/-,2657/1209/-/183/-',
        },
        '2': { width: 4756, height: 2978, one_width: 951, one_height: 596, name: '亚洲' },
        '3': { width: 5909, height: 2704, one_width: 1182, one_height: 548, name: '大洋洲' },
        '4': { width: 3664, height: 2712, one_width: 732, one_height: 542, name: '美洲' },
        '5': { width: 4872, height: 2957, one_width: 974, one_height: 591, name: '欧洲' }
    }; //地图大小
    MapsData.awards = {
        'a1': { name: '道具屋' },
        'a2': { name: '宠物屋' },
        'a3': { name: '权益屋' },
        'a4': { name: '停下后随机前进1-6步' },
        'a5': { name: '两个色子：双倍前进' },
        'a6': { name: '？：随机奖励' },
        'a7': { name: '💗：体力加1' },
        'a8': { name: '2倍：双倍成长值' }
    };
    return MapsData;
}());
__reflect(MapsData.prototype, "MapsData");
